Repository: collective/volto-tfa
Catalog: locales/*/LC_MESSAGES/volto.po
Languages: it

source: Cancel
it: Annulla

source: Login
it: Accedi

source: Login Failed
it: Accesso non riuscito

source: OTP Token
it: Token OTP

source: Sign in to start session
it: Accedi per avviare la sessione

# addTfaInstructions1
source: Install an OTP app in your mobile device (e.g. Google Authenticator, Microsoft Authenticator, Authy, LastPass Authenticator, ...)
it: Installa un'app OTP sul tuo dispositivo mobile (es. Google Authenticator, Microsoft Authenticator, Authy, LastPass Authenticator, ...)

# addTfaInstructions2
source: Scan the QR code with your OTP app
it: Scansiona il codice QR con la tua app OTP

# addTfaInstructions3
source: Enter the OTP code generated by the app in the OTP field below
it: Inserisci il codice OTP generato dall'app nel campo OTP sottostante

# addTfaInstructions4
source: Click the confirm button. If the OTP code is correct, 2FA will be enabled. Next time you login, you will be asked for the OTP provided by your app.
it: Clicca sul pulsante di conferma. Se il codice OTP è corretto, l'autenticazione a due fattori sarà abilitata. La prossima volta che effettuerai l'accesso, ti verrà chiesto l'OTP fornito dalla tua app.

source: OTP Challenge
it: Verifica OTP

# tfaPreferences
source: 2FA Preferences
it: Preferenze 2FA

# tfa_preferences_description
source: To configure Two Factor Authentication (2FA), you should link your account and the authentication app on your mobile device.
it: Per configurare l'autenticazione a due fattori (2FA), devi collegare il tuo account e l'app di autenticazione sul tuo dispositivo mobile.

# tfa_preferences_reset
source: If you need to reset your 2FA, you can do it by clicking the checkbox below, disabling 2FA, and then enabling it again.
it: Se devi reimpostare la tua 2FA, puoi farlo cliccando sulla casella di controllo sottostante, disabilitando la 2FA e quindi abilitandola nuovamente.

# tfa_preferences_step1
source: Enable Two Factor authentication using the checkbox below
it: Abilita l'autenticazione a due fattori utilizzando la casella di controllo sottostante

# tfa_preferences_step2
source: Install an OTP app in your mobile device (e.g. Google Authenticator, Microsoft Authenticator, Authy, LastPass Authenticator, ...)
it: Installa un'app OTP sul tuo dispositivo mobile (es. Google Authenticator, Microsoft Authenticator, Authy, LastPass Authenticator, ...)

# tfa_preferences_step3
source: Scan the QR code with your OTP app
it: Scansiona il codice QR con la tua app OTP

# tfa_preferences_step4
source: Enter the OTP code generated by the app in the OTP field below
it: Inserisci il codice OTP generato dall'app nel campo OTP sottostante

# tfa_preferences_step5
source: Click the confirm button. If the OTP code is correct, 2FA will be enabled. Next time you login, you will be asked for the OTP provided by your app.
it: Clicca sul pulsante di conferma. Se il codice OTP è corretto, l'autenticazione a due fattori sarà abilitata. La prossima volta che effettuerai l'accesso, ti verrà chiesto l'OTP fornito dalla tua app.

# tfa_preferences_title
source: Two Factor Authentication
it: Autenticazione a due fattori
